const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7', ()=> {
  expect(sum(2,5)).toBe(7);
});

// ------------------------------------------------------

// 10 + 100 เท่ากับ 110
test('10 + 100 เท่ากับ 110', ()=> {
  expect(sum(10,100)).toBe(110);
});

// 5 + 2 เท่ากับ 7
test('5 + 2 เท่ากับ 7', ()=> {
  expect(sum(5,2)).toBe(7);
});

// 5 + 55 เท่ากับ 60
test('5 + 5 เท่ากับ 60', ()=> {
  expect(sum(5,55)).toBe(60);
});




// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
